src/InformationRegisters/СчетчикЗапусковКлиента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>СчетчикЗапусковКлиента</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаПоследнегоЗапуска</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоЗапусков</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ЭтоАктивный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоМобильныйКлиент</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапретОткрытияОпроса</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПервогоЗапуска</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапретОткрытияФормыПереходаВМК</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИдентификаторКлиента</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/CommonModules/МобильныйКлиентУНФВызовСервера/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// См. РегистрыСведений.СчетчикДляОткрытияФормыОценкиМобильногоКлиента.ЗначениеСчетчика
Функция ЗначениеСчетчикаДляОткрытияФормыОценки() Экспорт
	
	Возврат РегистрыСведений.СчетчикДляОткрытияФормыОценкиМобильногоКлиента.ЗначениеСчетчика();
	
КонецФункции

// См. РегистрыСведений.СчетчикДляОткрытияФормыОценкиМобильногоКлиента.УстановитьЗначение
Процедура УстановитьСчетчикДляОткрытияФормыОценки(ЗначениеСчетчика) Экспорт
	
	РегистрыСведений.СчетчикДляОткрытияФормыОценкиМобильногоКлиента.УстановитьЗначение(ЗначениеСчетчика);
	
КонецПроцедуры

// См. РегистрыСведений.СчетчикЗапусковКлиента.УвеличитьСчетчик
Процедура УвеличитьСчетчикЗапусковКлиента(ЭтоМобильныйКлиент) Экспорт
	
	РегистрыСведений.СчетчикЗапусковКлиента.УвеличитьСчетчик(ЭтоМобильныйКлиент);
	
КонецПроцедуры

// См. РегистрыСведений.СчетчикЗапусковКлиента.ЗначенияСчетчика
Функция ЗначенияСчетчикаЗапусковКлиента() Экспорт
	
	Возврат РегистрыСведений.СчетчикЗапусковКлиента.ЗначенияСчетчика();
	
КонецФункции

// См. РегистрыСведений.СчетчикЗапусковКлиента.УстановитьЗапретОткрытияФормыОпроса
Процедура УстановитьЗапретОткрытияФормыОпроса(ЗапретОткрытияОпроса) Экспорт
	
	РегистрыСведений.СчетчикЗапусковКлиента.УстановитьЗапретОткрытияФормыОпроса(ЗапретОткрытияОпроса);
	
КонецПроцедуры

// См. ОбщегоНазначенияПереопределяемый.ПриДобавленииПараметровРаботыКлиентаПриЗапуске.
//
Процедура ПриДобавленииПараметровРаботыКлиентаПриЗапуске(Параметры) Экспорт
	
	Параметры.Вставить("ПараметрыЗапускаМобильногоКлиента", ЗначенияСчетчиков(ОбщегоНазначения.ЭтоМобильныйКлиент()));
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ЗначенияСчетчиков(ЭтоМобильныйКлиент)
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("НужноОткрытьФормуОценкиМобильногоКлиента", Ложь);
	Если ЭтоМобильныйКлиент Тогда
		СчетчикОткрытияФормыОценкиПриложения = МобильныйКлиентУНФВызовСервера.ЗначениеСчетчикаДляОткрытияФормыОценки();
		Если СчетчикОткрытияФормыОценкиПриложения >= 3 Тогда
			СтруктураВозврата.НужноОткрытьФормуОценкиМобильногоКлиента = Истина;
		ИначеЕсли СчетчикОткрытияФормыОценкиПриложения <> -1 Тогда
			СчетчикОткрытияФормыОценкиПриложения = СчетчикОткрытияФормыОценкиПриложения + 1;
			МобильныйКлиентУНФВызовСервера.УстановитьСчетчикДляОткрытияФормыОценки(СчетчикОткрытияФормыОценкиПриложения);
		КонецЕсли;
	КонецЕсли;
	
	МобильныйКлиентУНФВызовСервера.УвеличитьСчетчикЗапусковКлиента(ЭтоМобильныйКлиент);
	
	ЗначенияСчетчикаЗапусковКлиента = МобильныйКлиентУНФВызовСервера.ЗначенияСчетчикаЗапусковКлиента();
	
	СтруктураВозврата.Вставить("ЗначенияСчетчикаЗапусковКлиента", ЗначенияСчетчикаЗапусковКлиента);
	СтруктураВозврата.Вставить("ЭтоМобильныйКлиент", ЭтоМобильныйКлиент);
	
	Возврат СтруктураВозврата;
	
КонецФункции

#КонецОбласти
